<div style="text-align: center;">
    <h1>Pandas Concatenate Dataframes</h1>
</div>

<span style="color: blue;"> **Basic Concatenation**</span>

Pandas Concat function is used to join or append dataframes.

In [ ]:
import pandas as pd

bd_weather = pd.DataFrame({
    "city": ["sylhet", "rajshahi", "dhaka"],
    "temperature": [32, 45, 30],
    "humidity": [80, 60, 78],
})

bd_weather

       city  temperature  humidity
0    sylhet           32        80
1  rajshahi           45        60
2     dhaka           30        78

In [3]:
us_weather = pd.DataFrame({
    "city": ["georgia", "new york", "chicago"],
    "temperature": [21, 14, 35],
    "humidity": [68, 65, 75],
})

us_weather

       city  temperature  humidity
0   georgia           21        68
1  new york           14        65
2   chicago           35        75

In [ ]:
# combine to dataframes into one df. 
df = pd.concat([bd_weather, us_weather])
df

       city  temperature  humidity
0    sylhet           32        80
1  rajshahi           45        60
2     dhaka           30        78
0   georgia           21        68
1  new york           14        65
2   chicago           35        75

<span style="color: blue;">**Ignore Index**</span>

In [ ]:
# it resovles and continues index
df = pd.concat([bd_weather, us_weather], ignore_index=True)
df

       city  temperature  humidity
0    sylhet           32        80
1  rajshahi           45        60
2     dhaka           30        78
3   georgia           21        68
4  new york           14        65
5   chicago           35        75

<span style="color: blue;">**Concatenation and Keys**</span>

In [ ]:
# creates an additional index, passed as keys
df = pd.concat([bd_weather, us_weather], keys=["bangladesh", "us"])
df

                  city  temperature  humidity
bangladesh 0    sylhet           32        80
           1  rajshahi           45        60
           2     dhaka           30        78
us         0   georgia           21        68
           1  new york           14        65
           2   chicago           35        75

In [ ]:
# shows specific index
df.loc["us"]

       city  temperature  humidity
0   georgia           21        68
1  new york           14        65
2   chicago           35        75

In [ ]:
# shows specific index
df.loc["bangladesh"]

       city  temperature  humidity
0    sylhet           32        80
1  rajshahi           45        60
2     dhaka           30        78

<span style="color: blue;">**Concatenation using Index**</span>

In [ ]:
# this new df only contains temp data. 
temperature_df = pd.DataFrame({
    "city": ["sylhet", "rajshahi", "dhaka"],
    "temperature": [32, 45, 30]
}, index=[0,1,2])

temperature_df

       city  temperature
0    sylhet           32
1  rajshahi           45
2     dhaka           30

In [22]:
windspeed_df = pd.DataFrame({
    "city": ["sylhet", "rajshahi", "dhaka"],
    "windpseed": [7, 12, 9],
}, index= [0,1,2]) # index is used to align rows from dfs

windspeed_df

       city  windpseed
0    sylhet          7
1  rajshahi         12
2     dhaka          9

<span style="color: blue;">**Concatenate dataframe with series**</span>

In [23]:
s = pd.Series(["Humid", "Dry", "Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [25]:
df = pd.concat([temperature_df, s], axis=1)
df

       city  temperature  event
0    sylhet           32  Humid
1  rajshahi           45    Dry
2     dhaka           30   Rain